tugas7/benchmark_result/test_result_100_1.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            10001

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      1
Time taken for tests:   50.998 seconds
Complete requests:      100
Failed requests:        0
Total transferred:      13600 bytes
HTML transferred:       2400 bytes
Requests per second:    1.96 [#/sec] (mean)
Time per request:       509.975 [ms] (mean)
Time per request:       509.975 [ms] (mean, across all concurrent requests)
Transfer rate:          0.26 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       1
Processing:   104  510 185.7    476    1005
Waiting:      104  474 174.7    454    1000
Total:        105  510 185.7    476    1005

Percentage of the requests served within a certain time (ms)
  50%    476
  66%    526
  75%    599
  80%    690
  90%    813
  95%    856
  98%    971
  99%   1005
 100%   1005 (longest request)