tugas7/benchmark_result/test_result_10_5.txt
This is ApacheBench, Version 2.3 <$Revision: 1807734 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 127.0.0.1 (be patient).....done


Server Software:        myserver/1.0
Server Hostname:        127.0.0.1
Server Port:            10001

Document Path:          /
Document Length:        24 bytes

Concurrency Level:      5
Time taken for tests:   1.815 seconds
Complete requests:      10
Failed requests:        0
Total transferred:      1360 bytes
HTML transferred:       240 bytes
Requests per second:    5.51 [#/sec] (mean)
Time per request:       907.583 [ms] (mean)
Time per request:       181.517 [ms] (mean, across all concurrent requests)
Transfer rate:          0.73 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    2   2.5      3       6
Processing:   455  805 287.6    935    1324
Waiting:      444  800 287.5    933    1324
Total:        458  807 289.2    936    1330

Percentage of the requests served within a certain time (ms)
  50%    936
  66%    970
  75%    978
  80%    998
  90%   1330
  95%   1330
  98%   1330
  99%   1330
 100%   1330 (longest request)